---
kind: other
id: Properties.T:Autodesk.Revit.DB.RevitLinkOptions
source: html/e5b1b4a2-77a3-c086-78d1-3f36df2f47a5.htm
---
# RevitLinkOptions Properties

The type of path to use when creating the link. If true, Revit will
 store a relative path for the link. If false, Revit will store an absolute
 path.
If the link is to a Revit Server location, isRelative must be false.